app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リーダブルコード2"], ["body", "kkkk"], ["created_at", "2019-01-06 03:38:05.052657"], ["updated_at", "2019-01-06 03:38:05.052657"]]
---
  def create
    book = Book.new(book_params)
    book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "aaaasasa"], ["updated_at", "2019-01-06 03:47:58.448234"], ["id", 4]]
---
  def update
    book = Book.find(params[:id])
    book.update(book_params)